Revit 2026 API

# DistanceMeasuredFrom Enumeration

---

Indicates if the distance is measured from the top or bottom of the wall.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DistanceMeasuredFrom
```
```vb
Public Enumeration DistanceMeasuredFrom
```
```cpp
public enum class DistanceMeasuredFrom
```
```fsharp
type DistanceMeasuredFrom
```

| Member name | Value | Description |
| --- | --- | --- |
| Base | 0 | From bottom. |
| Top | 1 | From top. |

#### Reference

Autodesk.Revit.DB Namespace